#### 📖 Terraform Plan -> deploy-auth-infra

<details><summary>Clique para ver os detalhes</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-SOAT-ORG/fiap-soat-auth/runs/run-ntH1Nig9mMUq4oUY

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
aws_apigatewayv2_api.http_api: Refreshing state... [id=bqs7n863ib]
aws_iam_role.lambda_exec_role: Refreshing state... [id=auth-cpf-lambda-role]
data.aws_caller_identity.current: Refreshing...
aws_s3_bucket.lambda_artifacts: Refreshing state... [id=fiap-soat-lambda-code-artifacts]
data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=auth-cpf-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.auth_lambda: Refreshing state... [id=auth-cpf-lambda]
aws_lambda_permission.api_gw_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=86xu0dm]
aws_apigatewayv2_route.auth_route: Refreshing state... [id=oavub0f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_stage.default_stage will be created
  + resource "aws_apigatewayv2_stage" "default_stage" {
      + api_id        = "bqs7n863ib"
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-1"
      + tags_all      = (known after apply)
    }

  # aws_lambda_function.auth_lambda will be updated in-place
  ~ resource "aws_lambda_function" "auth_lambda" {
        id                             = "auth-cpf-lambda"
      ~ last_modified                  = "2025-11-28T18:20:22.000+0000" -> (known after apply)
      ~ s3_key                         = "lambda-auth-main-d675140.zip" -> "lambda-auth-deploy-k8-aws-41edd1a.zip"
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @GustaSchmidt, Action: `pull_request`*